examples/tube/setup_files/openfoam3d_v10/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      fixed;

timePrecision   4;

runTimeModifiable false;

adjustTimeStep  no;

// ************************************************************************* //
